In [6]:
import pandas as pd
df = pd.Series([4,7,-5,3], index= ['d','b','a','c'])

In [9]:
df['d']

4

In [11]:
s1 = pd.Series([20,15,18,31], index= ['Mango','Strawberry','Blueberry','Vanilla'])
s2 = pd.Series([20,30,15,20,20], index= ['Strawberry','Vanilla','Banana','Mango','Plain'])
s3 = s1.add(s2)
s3

Banana         NaN
Blueberry      NaN
Mango         40.0
Plain          NaN
Strawberry    35.0
Vanilla       61.0
dtype: float64

In [15]:
s3['Mango'] >=  s1.add(s2, fill_value = 0)['Mango']

True

In [17]:
import numpy as np
S = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])

In [32]:
S['b':'e']

b    1
c    2
d    3
e    4
dtype: int32

In [44]:
df= pd.DataFrame(index = ['R1','R2','R3','R4'], columns = ['a','b','c'])

In [45]:
df['a'] = [5,5,71,67]
df['b'] = [6,82,31,37]
df['c'] = [20,28,92,49]
df

     a   b   c
R1   5   6  20
R2   5  82  28
R3  71  31  92
R4  67  37  49

In [47]:
f = lambda x: x.max() + x.min()
df_new = df.apply(f)
df_new

a     76
b     88
c    112
dtype: int64

In [50]:
df = pd.DataFrame({'Item':['item_1','item_1','item_1','item_2','item_2','item_2'],
                   'Store':['A','B','C','A','B','C'],
                   'Quantity sold':[]})
df

     Item
0  item_1
1  item_1
2  item_1
3  item_2
4  item_2
5  item_2